results/results_r5_large/results_r5_large_run2/oltp_read_write_t8/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 24.59 qps: 500.99 (r/w/o: 351.73/27.59/121.67) lat (ms,95%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 23.90 qps: 478.82 (r/w/o: 335.11/26.00/117.70) lat (ms,95%): 682.06 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 26.10 qps: 520.60 (r/w/o: 364.70/28.70/127.20) lat (ms,95%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 25.10 qps: 503.00 (r/w/o: 352.30/28.10/122.60) lat (ms,95%): 733.00 err/s: 0.10 reconn/s: 0.00
[ 50s ] thds: 8 tps: 28.20 qps: 565.50 (r/w/o: 395.90/31.10/138.50) lat (ms,95%): 623.33 err/s: 0.10 reconn/s: 0.00
[ 60s ] thds: 8 tps: 40.40 qps: 808.60 (r/w/o: 565.70/43.40/199.50) lat (ms,95%): 404.61 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 23.50 qps: 474.40 (r/w/o: 332.20/25.50/116.70) lat (ms,95%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 24.90 qps: 495.80 (r/w/o: 347.10/27.60/121.10) lat (ms,95%): 816.63 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 26.60 qps: 529.10 (r/w/o: 369.80/28.80/130.50) lat (ms,95%): 682.06 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 23.10 qps: 466.90 (r/w/o: 327.60/25.90/113.40) lat (ms,95%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 27.40 qps: 545.60 (r/w/o: 381.60/29.90/134.10) lat (ms,95%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 23.20 qps: 466.40 (r/w/o: 326.50/25.20/114.70) lat (ms,95%): 623.33 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            44520
        write:                           3483
        other:                           15595
        total:                           63598
    transactions:                        3178   (26.45 per sec.)
    queries:                             63598  (529.33 per sec.)
    ignored errors:                      2      (0.02 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      26.4504
    time elapsed:                        120.1492s
    total number of events:              3178

Latency (ms):
         min:                                   68.83
         avg:                                  302.22
         max:                                 1246.35
         95th percentile:                      657.93
         sum:                               960460.72

Threads fairness:
    events (avg/stddev):           397.2500/4.47
    execution time (avg/stddev):   120.0576/0.05